Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Constructor
Overload List
Name | Description
CylindricalSurface(Arc, Double)
 Initializes a new instance of the CylindricalSurface class from a base arc and a height. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
CylindricalSurface(List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the CylindricalSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
CylindricalSurface(Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the CylindricalSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the cylinder). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
CylindricalSurface(Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the CylindricalSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the cylinder).
Top
See Also
Reference
CylindricalSurface Class
Tekla.Structures.Model Namespace